const FirstNameReg = {
    CN: /^[\u4E00-\u9FFF\u3400-\u4DBF\uF900-\uFAFF\u00B7 ]{2,15}$/u,
    TH: /^(?=.{2,50}$)([a-zA-Z]+(?:\s[a-zA-Z]+){0,5})$|^(?=.{2,50}$)([\u0E00-\u0E7F]+(?:\s[\u0E00-\u0E7F]+){0,5})$/u,
    VN: /^(?=.{2,50}$)([a-zA-Z\u00C0-\u024F\u1E00-\u1EFF']+(?:\s[a-zA-Z\u00C0-\u024F\u1E00-\u1EFF']+){0,5})$/u,
};
const ShipAddressLabelReg = {
    CN: /^[\u4E00-\u9FFF\u3400-\u4DBF\uF900-\uFAFFA-Za-z\u00B7 ]{2,10}$/u,
    TH: /^[a-zA-Z0-9\u0E00-\u0E7FÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚÝàáâãèéêìíòóôõùúýĂăÂâĐđĨĩŨũƠơƯưẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ\s]{2,15}$/,
    VN: /^[a-zA-Z0-9\u0E00-\u0E7FÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚÝàáâãèéêìíòóôõùúýĂăÂâĐđĨĩŨũƠơƯưẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ\s]{2,15}$/
};

const ShipUserNameReg = {
    CN: /^[\u4E00-\u9FFF\u3400-\u4DBF\uF900-\uFAFF\u00B7 ]{2,10}$/u,
    TH: /^[a-zA-Z0-9\u0E00-\u0E7FÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚÝàáâãèéêìíòóôõùúýĂăÂâĐđĨĩŨũƠơƯưẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ\s]{2,50}$/,
    VN: /^[a-zA-Z0-9\u0E00-\u0E7FÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚÝàáâãèéêìíòóôõùúýĂăÂâĐđĨĩŨũƠơƯưẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ\s]{2,50}$/
};

const AddressReg = {
    CN: /^[\u4E00-\u9FFF\u3400-\u4DBF\uF900-\uFAFFA-Za-z0-9#'.,\-\/&()\uFF03\uFF07\uFF0E\uFF0C\uFF0D\uFF0F\uFF06\uFF08\uFF09 \u00B7]{1,50}$/u, // https://arcadie.atlassian.net/browse/CXF1-8124
    TH: /^[a-zA-Z0-9\u0E00-\u0E7FÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚÝàáâãèéêìíòóôõùúýĂăÂâĐđĨĩŨũƠơƯưẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ\s#'.,\-\/&()]{5,100}$/,
    VN: /^[a-zA-Z0-9\u0E00-\u0E7FÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚÝàáâãèéêìíòóôõùúýĂăÂâĐđĨĩŨũƠơƯưẠạẢảẤấẦầẨẩẪẫẬậẮắẰằẲẳẴẵẶặẸẹẺẻẼẽẾếỀềỂểỄễỆệỈỉỊịỌọỎỏỐốỒồỔổỖỗỘộỚớỜờỞởỠỡỢợỤụỦủỨứỪừỬửỮữỰựỲỳỴỵỶỷỸỹ\s#'.,\-\/&()]{5,100}$/
};

const ShipZipCodeReg = {
    CN: /^[1-9][0-9]{5}$/,
    TH: /^[1-9][0-9]{4}$/,
    VN: /^[1-9][0-9]{4}$/,
};

const allRegModules = {
    FirstNameReg,
    ShipAddressLabelReg,
    AddressReg,
    ShipUserNameReg,
    ShipZipCodeReg
    // LastName, Address, etc. 可继续添加
};

const RegMap = new Proxy(
    {},
    {
        get(target, prop) {
            const module = allRegModules[prop];
            if (module && typeof module === "object") {
                return module[window.LANGUAGE] || module["CN"];
            }
            return null;
        },
    },
);

export default RegMap;